{{time}} [{{name}}] 様より以下のお問い合わせがありました。

---------------------------------
お問い合わせ内容
---------------------------------

■お名前                 {{name}}

■フリガナ               {{kana}}

■性別                   {{sex}}

■年齢                   {{age}}

■血液型                 {{blood_type}}

■職業                   {{job}}

■郵便番号               {{zip}}

■住所                   {{address12}}

■ビル・マンション名     {{address3}}

■電話番号               {{tel}}

■メールアドレス         {{mail}}

■興味のあるカテゴリー   {{category}}

■お問合せ内容           {{info}}