{{time}} [{{name}}] 様より以下のお問い合わせがありました。

---------------------------------
お問い合わせ内容
---------------------------------

■お名前                 {{name}}

■フリガナ               {{kana}}

■性別                  {{sex_id}}

■年齢                  {{age_id}}

■血液型                {{blood_type_id}}

■職業                  {{job_id}}

■郵便番号               {{zip}}

■住所                  {{address12}}

■ビル・マンション名      {{address3}}

■電話番号               {{tel}}

■メールアドレス          {{mail}}

■興味のあるカテゴリー     {{inquiry_content_ids}}

■お問合せ内容           {{inpuiry_detail}}